/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_isprint.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: cjia <cjia@student.42tokyo.jp>             +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2023/05/17 14:29:58 by cjia              #+#    #+#             */
/*   Updated: 2023/06/09 15:05:05 by cjia             ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

int	ft_isprint(int c)
{
	return (c >= 32 && c <= 126);
}

// int	main(void)
// {
// 	char str[10];

// 	printf("一文字入力せよ\n");
// 	scanf("%s", str); // &strではない
// 	if (str[1] != '\0')
// 		printf("複数文字ではなく、一文字のみいれてください\n");
// 	else
// 		printf("%d\n", ft_isprint(str[0]));
// 	return (0);
// }